# Sorting Data

In [1]:
import pandas as pd

In [5]:
data = {
    "Name": ["Carl", "Bob", "Christi", "Alex"],
    "Age": [10, 43, 25, 17],
    "Weight": [43, 70, 86, 65]
}
df = pd.DataFrame(data)
df

      Name  Age  Weight
0     Carl   10      43
1      Bob   43      70
2  Christi   25      86
3     Alex   17      65

In [6]:
df.sort_values(by=["Name"], ascending=False)

      Name  Age  Weight
2  Christi   25      86
0     Carl   10      43
1      Bob   43      70
3     Alex   17      65

In [9]:
df.sort_values(by=["Age"])

      Name  Age  Weight
0     Carl   10      43
3     Alex   17      65
2  Christi   25      86
1      Bob   43      70

In [ ]:
data2 = {
    "Name": ["Carl", "Bob", "Christi", "Alex"],
    "Age": [10, 43, 25, 17],
    "Weight": [43, 70, 86, 65]
}
df2 = pd.DataFrame(data2)
df2